FIFO_Files/src/Documents/ПродажаТовара/ПродажаТовара.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПродажаТовара</name>
  <registerRecords>AccumulationRegister.СвободныеОстатки</registerRecords>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>НаименованиеТовара</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <type>
        <types>CatalogRef.ЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>9</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

FIFO_Files/src/Documents/ПродажаТовара/ObjectModule.bsl
//// Используем такой метод контроля остатков: 
//// Запросом получаются остатки товаров и данные документа
//// В цикле выполняется контроль достаточности товаров
//// Если товаров недостаточно, то документ не проводится
//// Если товаров достаточно — выполняются движения-расход

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	// 1. Очистка движений и установка режима записи
	Движения.СвободныеОстатки.Записывать = Истина;
	Движения.СвободныеОстатки.Очистить();

	// 2. Управляемая блокировка (чтобы никто не продал тот же товар в эту же секунду)
	Блокировка = Новый БлокировкаДанных;
	ЭлементБлокировки = Блокировка.Добавить("РегистрНакопления.СвободныеОстатки");
	ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
	ЭлементБлокировки.ИсточникДанных = Товары; // ТЧ документа
	ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Товар", "НаименованиеТовара");
	Блокировка.Заблокировать();

	// 3. Запрос: получаем данные документа и остатки по партиям (срокам) одним махом
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Док.НаименованиеТовара КАК Товар,
	|	СУММА(Док.Количество) КАК КоличествоВДокументе
	|ПОМЕСТИТЬ ВТ_ТоварыДок
	|ИЗ
	|	Документ.ПродажаТовара.Товары КАК Док
	|ГДЕ
	|	Док.Ссылка = &Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	Док.НаименованиеТовара
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ.Товар КАК Товар,
	|	ВТ.Товар.Представление КАК ТоварПредставление,
	|	ЕСТЬNULL(ВТ.КоличествоВДокументе, 0) КАК КоличествоВДокументе,
	|	Остатки.СрокГодности КАК СрокГодности,
	|	ЕСТЬNULL(Остатки.КоличествоОстаток, 0) КАК КоличествоПартии
	|ИЗ
	|	ВТ_ТоварыДок КАК ВТ
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.СвободныеОстатки.Остатки(
	|				&Момент,
	|				Товар В
	|					(ВЫБРАТЬ
	|						ВТ_ТоварыДок.Товар
	|					ИЗ
	|						ВТ_ТоварыДок)) КАК Остатки
	|		ПО ВТ.Товар = Остатки.Товар
	|
	|УПОРЯДОЧИТЬ ПО
	|	Товар,
	|	СрокГодности
	|ИТОГИ
	|	МАКСИМУМ(КоличествоВДокументе),
	|	СУММА(КоличествоПартии)
	|ПО
	|	Товар";

	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	// Исключая — чтобы не видеть свои же движения при перепроведении
	Запрос.УстановитьПараметр("Момент", Новый Граница(МоментВремени(), ВидГраницы.Исключая));

	РезультатЗапроса = Запрос.Выполнить();

	// 4. Обход по группировкам (Товарам)
	ВыборкаТовар = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);

	Пока ВыборкаТовар.Следующий() Цикл
		
		// Проверка: хватает ли нам товара ВООБЩЕ (по всем срокам годности)
		Если ВыборкаТовар.КоличествоВДокументе > ВыборкаТовар.КоличествоПартии Тогда
			
			Нехватка = ВыборкаТовар.КоличествоВДокументе - ВыборкаТовар.КоличествоПартии;
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = СтрШаблон("Недостаточно товара %1. Не хватает %2",ВыборкаТовар.ТоварПредставление,Нехватка);
			Сообщение.Сообщить();
			
			Отказ = Истина;
		КонецЕсли;

		// Если уже есть отказ, переходим к следующему товару
		Если Отказ Тогда Продолжить; КонецЕсли;

		// 5. Обход детальных записей (конкретных сроков годности)
		НужноСписать = ВыборкаТовар.КоличествоВДокументе;
		ВыборкаДетали = ВыборкаТовар.Выбрать(); // вызываем выборку от текущей строки
		
		Пока ВыборкаДетали.Следующий() И НужноСписать > 0 Цикл
			
			СписываемИзПартии = Мин(НужноСписать, ВыборкаДетали.КоличествоПартии);
			
			Если СписываемИзПартии > 0 Тогда
				
				Движение = Движения.СвободныеОстатки.Добавить();
				Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
				Движение.Период = Дата;
				Движение.Товар = ВыборкаДетали.Товар;
				Движение.СрокГодности = ВыборкаДетали.СрокГодности;
				Движение.Количество = СписываемИзПартии;
				
				НужноСписать = НужноСписать - СписываемИзПартии;
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЦикла;

КонецПроцедуры
